{
    "name": "Solid Fuel Fission Reactors",
    "icon": "nuclearcraft:solid_fission_controller",
    "category": "patchouli:fission",
    "pages": [
        {
            "type": "text",
            "text": ""
        },
        {
          "type": "spotlight",
          "item": "nuclearcraft:solid_fission_controller",
          "title": "Solid Fuel Fission Reactor Controller",
          "text": "The Solid Fuel Fission Reactor Controller is the brain of the solid fuel fission reactor. One is needed on the face of the reactor in order for it to form. When the multiblock is properly formed, it will show useful information about the number of clusters, net heating and the reactor's high pressure steam output."
         },
         {
          "type": "text",
          "title": "Clusters",
          "text": "Clusters consist of Fuel Cells, Heat Sinks and Neutron Shields. They have to be connected to the reactor's casing whether it be directly or using conductors in order to operate. Each of the clusters in a reactor produce heat. If ths generated heat in a cluster is positive, it can cause the cells in that cluster to meltdown."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:solid_fission_cell",
          "title": "Fission Reactor Cell",
          "text": "Fission Reactor Cells are the heart of the solid fuel fission reactor. In a working reactor, fission fuels are inserted into these. If the neutron flux entering the fuel cell is higher than the criticality of its contained fuel, the fuel will undergo fission, releasing heat, high energy neutrons and depleting the fuel. $(br)The heat generated by each fuel cell is equal to the base heat of the fuel multiplied by the number of moderator lines connected to the fuel cell. $(br2)Fuel Cells can be filtered by right-clicking them with a valid fuel or placing a fuel in them before the reactor is formed, which leaves a ghost item in the fuel cell. Only filtered Fuel Cell Ports will be able to insert into matching filtered cells. If not filtered, the fuel cells will accept any fuel placed into the fuel cell ports."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:solid_fission_sink",
          "title": "Fission Reactor Heat Sinks",
          "text": "Fission Reactor Heat Sinks cool down fuel cells and other components of the reactor that generate heat. Each variant of heat sink removes a certain amount of heat and specific placement rules on how it can be placed in a reactor. In order for a heat sink to become active, it must be in an active cluster, either by touching fuel cells or other heat sinks. $(br2) The heat sink requirements are listed in the description of the heat sink and are generally in the form of \"needs X reactor components of type Y to function\" where X is a number and Y is a reactor component such as a casing, fuel cell or other heatsink."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:ingot_block:8",
          "title": "Fission Reactor Moderators",
          "text": "Fission Reactor Moderators slow down the high energy neutrons released during fission. These neutrons are then used to cause fission in other fuel cells. In order for moderators to work, they must be placed in a straight line with a fuel cell on at least one end. The neutron flux generated at the other end is equal to the sum of the flux factors of all the moderators in that line. The maximum length of a moderator line is 4."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_reflector",
          "title": "Neutron Reflectors",
          "text": "Neutron Reflectors can reflect neutrons back to the fuel cell that produced them, multiplying neutron flux by a fixed value, but also changing the efficiency of the connected fuel cell."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_irradiator",
          "title": "Neutron Irradiators",
          "text": "Neutron Irradiators are abld to use neutrons from moderator lines in order to irradiate certain materials. The speed of the irradiation is dependent on the neutron flux received. They can be filtered by right-clicking on them with an irradiatable material or placing an irradiatable material inside before the reactor is formed."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_shield",
          "title": "Neutron Shields",
          "text": "Neutron Shields stop neutrons in moderator lines which can help in shutting down a reactor, but they generate additional heat that needs to be dealt with. They can also be used to form a cluster with an otherwise inaccessible cell."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_conductor",
          "title": "Conductors",
          "text": "Conductors connect clusters to the reactor casing."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_source",
          "title": "Neutron Sources",
          "text": "Neutron Sources are needed to kickstart the fission chain reaction inside a reactor. They are placed in the faces of the casing, facing towards the fuel cell that they will be priming. A redstone signal is needed to activate the neutron sources. There are multiple tiers of neutron sources, each with a different multiplier to fuel cell efficiency. Using better neutron sources and fewer neutron sources will often help in increasing a reactor's efficiency. $(br)Some of the heavier fuels such as HECf-251 Nitride are self-priming and do not need a neutron source."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_cell_port",
          "title": "Fuel Cell Port",
          "text": "Fuel Cell Ports are used to add fuel to fuel cells and remove depleted fuel from fuel cells. They can be filtered to a specific fuel type similar to fuel cells. They are placed in the faces of the reactor casing."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_irradiator_port",
          "title": "Irradiator Port",
          "text": "Irradiator Ports are used to add and remove items from neutron irradiators. They can be filtered to a specific fuel type similar to irradiators. They are placed in the faces of the reactor casing."
         },
         {
          "type": "spotlight",
          "item": "nuclearcraft:fission_vent",
          "title": "Fission Reactor Vents",
          "text": ""
         }
    ],
	"sortnum": 2
}